import { title } from "process";

export const Aartilist:AartiObj[] = [
    {
        title:'🌸🌸 मां जगजननी जय जय आरती 🌸🌸',
        lyrics:`जगजननी जय! जय! मा! जगजननी जय! जय!!
                भयहारिणि, भवतारिणि, भवभामिननि जय जय।। टेक ।।

                तू ही सत-चित-सुखमय शुद्ध ब्रह्मरूपा।
                सत्य सनातन सुन्दर, पर-शिव सुर-भूपा।।जग.।।
                
                आदि अनादि अनामय अविचल अविनाशी।
                अमल अनन्त अगोचर अज आनंदराशी।।जग.।।
                
                अविकारी, अघहारी, अकल, कलाधारी।
                कर्ता विधि, भर्ता हरि, हर संहारकारी।।जग.।।

                तू विधि-वधू, रमा, तू उमा, महामाया।
                मूल प्रकृति, विद्या तू, तू जननी जाया।।जग.।।

                राम, कृष्ण तू, सीता, ब्रजरानी राधा।
                तू वाञ्छाकल्पद्रुम हारिणि सब बाधा।।जग.।।

                दश विद्या, नव दुर्गा नाना शस्त्रकरा।
                अष्टमातृका, योगिनि, नव-नव-रूप-धरा।।जग.।।

                तू परधामनिवासिनि, महाविलासिनि तू।
                तू ही श्मशानविहारिणि, ताण्डवलासिनि तू।।जग.।।

                सुर-मुनि-मोहिनि सौम्या तू शोभाधारा।
                विवसन विकट-सरूपा, प्रलयमयी धारा।।जग.।।

                तू ही स्नेहसुधामयि, तू अति गरलमना।
                रत्‍‌नविभूषित तू ही, तू ही अस्थि-तना।।जग.।।

                मूलाधारनिवासिनि, इह-पर-सिद्धिप्रदे।
                कालातीता काली, कमला तू वरदे।।जग.।।

                शक्ति शक्तिधर तू ही नित्य अभेदमयी।
                भेदप्रदर्शिनि वाणी विमले! वेदत्रयी।।जग.।।
                
                हम अति दीन दुखी मां! विपत-जाल घेरे।
                हैं कपूत अति कपटी, पर बालक तेरे।।जग.।।
                
                निज स्वभाववश जननी! दयादृष्टि कीजै।
                करुणा कर करुणामयि! चरण-शरण दीजै।।जग.।।`
    },
    {
        title: '🌸🌸 जय अम्बे गौरी आरती 🌸🌸',
        lyrics:`जय अम्बे गौरी, मैया जय श्यामा गौरी
                तुम को निशदिन ध्यावत
                तुम को निशदिन ध्यावत
                हरि ब्रह्मा शिवरी
                ॐ जय अम्बे गौरी
                जय अम्बे गौरी, मैया जय श्यामा गौरी

                तुम को निशदिन ध्यावत
                तुम को निशदिन ध्यावत
                हरि ब्रह्मा शिवरी
                ॐ जय अम्बे गौरी

                मांग सिंदूर विराजत, टीको मृगमद को
                मैया टीको मृगमद को
                उज्जवल से दोउ नैना
                उज्जवल से दोउ नैना
                चन्द्रबदन नीको
                ॐ जय अम्बे गौरी

                कनक समान कलेवर रक्ताम्बर राजे
                मैया रक्ताम्बर राजे
                रक्त पुष्प दल माला
                रक्त पुष्प दल माला
                कंठन पर साजे
                ॐ जय अम्बे गौरी

                केहरि वाहन राजत खड़्ग खप्पर धारी
                मैया खड़्ग खप्पर धारी
                सुर-नर मुनिजन सेवत
                सुर-नर मुनिजन सेवत
                तिनके दुखहारी
                ॐ जय अम्बे गौरी

                कानन कुण्डल शोभित, नासाग्रे मोती
                मैया नासाग्रे मोती
                कोटिक चन्द्र दिवाकर
                कोटिक चन्द्र दिवाकर
                राजत सम ज्योति
                ॐ जय अम्बे गौरी

                शुम्भ निशुम्भ विडारे, महिषासुर धाती
                मैया महिषासुर धाती
                धूम्र विलोचन नैना
                धूम्र विलोचन नैना
                निशदिन मदमाती
                ॐ जय अम्बे गौरी

                चण्ड मुण्ड संहारे, सोणित बीज हरे
                मैया सोणित बीज हरे
                मधु कैटभ दोऊ मारे
                मधु कैटभ दोऊ मारे
                सुर भयहीन करे
                ॐ जय अम्बे गौरी

                ब्रह्माणी रुद्राणी, तुम कमला रानी
                मैया तुम कमला रानी
                आगम निगम बखानी
                आगम निगम बखानी
                तुम शिव पटरानी
                ॐ जय अम्बे गौरी

                चौसठ योगिनी मंगल, नृत्य करत भैरों
                मैया नृत्य करत भैरों
                बाजत ताल मृदंगा
                बाजत ताल मृदंगा
                अरु बाजत डमरु
                ॐ जय अम्बे गौरी

                तुम ही जग की माता, तुम ही हो भर्ता
                मैया तुम ही हो भर्ता
                भक्तन की दुःख हरता
                भक्तन की दुःख हरता
                सुख सम्पत्ति कर्ता
                ॐ जय अम्बे गौरी

                भुजा चार अति शोभित, वर मुद्रा धारी
                मैया वर मुद्रा धारी
                मनवांछित फ़ल पावत
                मनवांछित फ़ल पावत
                सेवत नर-नारी
                ॐ जय अम्बे गौरी

                कंचन थार विराजत, अगर कपूर बाती
                मैया अगर कपूर बाती
                श्रीमालकेतु में राजत
                श्रीमालकेतु में राजत
                कोटि रत्न ज्योति
                ॐ जय अम्बे गौरी

                श्री अम्बे जी की आरती, जो कोई नर गावे
                मैया जो कोई नर गावे
                कहत शिवानंद स्वामी
                कहत शिवानंद स्वामी
                सुख संपत्ति पावे
                ॐ जय अम्बे गौरी

                जय अम्बे गौरी, मैया जय श्यामा गौरी
                तुम को निशदिन ध्यावत
                तुम को निशदिन ध्यावत
                हरि ब्रह्मा शिवरी
                ॐ जय अम्बे गौरी
                ॐ जय अम्बे गौरी
                ॐ जय अम्बे गौरी`
    },
    {
    title: '🌸🌸 जय भगवति देवि नमो वरदे 🌸🌸',
    lyrics:`जय भगवति देवि नमो वरदे
            जय पापविनाशिनि बहुफलदे।
            जय शुम्भनिशुम्भकपालधरे
            प्रणमामि तु देवि नरार्तिहरे॥

            जय चन्द्रदिवाकरनेत्रधरे
            जय पावकभूषितवक्त्रवरे।
            जय भैरवदेहनिलीनपरे
            जय अन्धकदैत्यविशोषकरे॥

            जय भगवति देवि नमो वरदे
            जय पापविनाशिनि बहुफलदे।
            जय शुम्भनिशुम्भकपालधरे
            प्रणमामि तु देवि नरार्तिहरे॥

            जय चन्द्रदिवाकरनेत्रधरे
            जय पावकभूषितवक्त्रवरे।
            जय भैरवदेहनिलीनपरे
            जय अन्धकदैत्यविशोषकरे॥

            जय भगवति देवि नमो वरदे
            जय पापविनाशिनि बहुफलदे।
            जय शुम्भनिशुम्भकपालधरे
            प्रणमामि तु देवि नरार्तिहरे॥`
    },
  {
    title: '🌸🌸 देव्यपराधक्षमापन स्तोत्रम् 🌸🌸',
    lyrics: `न मत्रं नो यन्त्रं तदपि च न जाने स्तुतिमहो
            न चाह्वानं ध्यानं तदपि च न जाने स्तुतिकथाः ।
            न जाने मुद्रास्ते तदपि च न जाने विलपनं
            परं जाने मातस्त्वदनुसरणं क्लेशहरणम् ॥१॥

            विधेरज्ञानेन द्रविणविरहेणालसतया
            विधेयाशक्यत्वात्तव चरणयोर्या च्युतिरभूत् ।
            तदेतत् क्षन्तव्यं जननि सकलोद्धारिणि शिवे
            कुपुत्रो जायेत क्वचिदपि कुमाता न भवति ॥२॥

            पृथिव्यां पुत्रास्ते जननि बहवः सन्ति सरलाः
            परं तेषां मध्ये विरलतरलोऽहं तव सुतः ।
            मदीयोऽयं त्यागः समुचितमिदं नो तव शिवे
            कुपुत्रो जायेत क्वचिदपि कुमाता न भवति ॥३॥

            जगन्मातर्मातस्तव चरणसेवा न रचिता
            न वा दत्तं देवि द्रविणमपि भूयस्तव मया ।
            तथापि त्वं स्नेहं मयि निरुपमं यत्प्रकुरुषे
            कुपुत्रो जायेत क्वचिदपि कुमाता न भवति ॥४॥

            परित्यक्ता देवा विविधविधसेवाकुलतया
            मया पञ्चाशीतेरधिकमपनीते तु वयसि ।
            इदानीं चेन्मातस्तव यदि कृपा नापि भविता
            निरालम्बो लम्बोदरजननि कं यामि शरणम् ॥५॥

            श्वपाको जल्पाको भवति मधुपाकोपमगिरा
            निरातङ्को रङ्को विहरति चिरं कोटिकनकैः ।
            तवापर्णे कर्णे विशति मनुवर्णे फलमिदं
            जनः को जानीते जननि जपनीयं जपविधौ ॥६॥

            चिताभस्मालेपो गरलमशनं दिक्पटधरो
            जटाधारी कण्ठे भुजगपतिहारी पशुपतिः ।
            कपाली भूतेशो भजति जगदीशैकपदवीं
            भवानि त्वत्पाणिग्रहणपरिपाटीफलमिदम् ॥७॥

            न मोक्षस्याकाङ्क्षा भवविभववाञ्छापि च न मे
            न विज्ञानापेक्षा शशिमुखि सुखेच्छापि न पुनः ।
            अतस्त्वां संयाचे जननि जननं यातु मम वै
            मृडानी रुद्राणी शिव शिव भवानीति जपतः ॥८॥

            नाराधितासि विधिना विविधोपचारैः
            किं रुक्षचिन्तनपरैर्न कृतं वचोभिः ।
            श्यामे त्वमेव यदि किञ्चन मय्यनाथे
            धत्से कृपामुचितमम्ब परं तवैव ॥९॥

            आपत्सु मग्नः स्मरणं त्वदीयं
            करोमि दुर्गे करुणार्णवेशि ।
            नैतच्छठत्वं मम भावयेथाः
            क्षुधातृषार्ता जननीं स्मरन्ति ॥१०॥

            जगदम्ब विचित्रमत्र किं
            परिपूर्णा करुणास्ति चेन्मयि ।
            अपराधपरम्परापरं
            न हि माता समुपेक्षते सुतम् ॥११॥
            मत्समः पातकी नास्ति पापघ्नी त्वत्समा न हि ।
            एवं ज्ञात्वा महादेवि यथायोग्यं तथा कुरु ॥१२॥`
  
    },
    {
        title:'🌸🌸 क्षमा-प्रार्थना 🌸🌸',
        lyrics:`अपराधसहस्राणि क्रियन्तेऽहर्निशं मया।
                दासोऽयमिति मां मत्वा क्षमस्व परमेश्वरि॥1॥


                आवाहनं न जानामि न जानामि विसर्जनम्।
                पूजां चैव न जानामि क्षम्यतां परमेश्वरि॥2॥


                मन्त्रहीनं क्रियाहीनं भक्तिहीनं सुरेश्वरि।
                यत्पूजितं मया देवि परिपूर्णं तदस्तु मे॥3॥


                अपराधशतं कृत्वा जगदम्बेति चोच्चरेत्।
                यां गतिं समवाप्नोति न तां ब्रह्मादयः सुराः॥4॥


                सापराधोऽस्मि शरणं प्राप्तस्त्वां जगदम्बिके।
                इदानीमनुकम्प्योऽहं यथेच्छसि तथा कुरु॥5॥


                अज्ञानाद्विस्मृतेर्भ्रान्त्या यन्न्यूनमधिकं कृतम्।
                तत्सर्वं क्षम्यतां देवि प्रसीद परमेश्वरि॥6॥


                कामेश्वरि जगन्मातः सच्चिदानन्दविग्रहे।
                गृहाणार्चामिमां प्रीत्या प्रसीद परमेश्वरि॥7॥


                गुह्यातिगुह्यगोप्त्री त्वं गृहाणास्मत्कृतं जपम्।
                सिद्धिर्भवतु मे देवि त्वत्प्रसादात्सुरेश्वरि॥8॥`
    },
    {
        title:'🌸🌸 पुष्पांजलि मंत्र 🌸🌸',
        lyrics:`ॐ यज्ञेन यज्ञमयजंत देवास्तानि धर्माणि प्रथमान्यासन्|
                ते हं नाकं महिमान: सचंत यत्र पूर्वे साध्या: संति देवा:
                ॐ राजाधिराजाय प्रसह्ये साहिने |
                नमो वयं वैश्रवणाय कुर्महे
                स मे कामान्कामकामाय मह्यम्|
                कामेश्वरो वैश्रवणो ददातु|
                कुबेराय वैश्रवणाय | महाराजाय नम:
                ॐ स्वस्ति साम्राज्यं भौज्यं स्वाराज्यं वैराज्यं
                पारमेष्ठ्यं राज्यं माहाराज्यमाधिपत्यमयं समंतपर्यायी
                सार्वायुष आंतादापरार्धात्पृथिव्यै समुद्रपर्यंता या एकराळिति
                तदप्येष श्लोकोऽभिगीतो मरुत: परिवेष्टारो मरुत्तस्यावसन्गृहे
                आविक्षितस्य कामप्रेर्विश्वेदेवा: सभासद इति।
                ॐ विश्व दकचक्षुरुत विश्वतो मुखो विश्वतोबाहुरुत
                विश्वतस्पात संबाहू ध्यानधव धिसम्भत त्रैत्याव भूमी जनयंदेव एकः।
                ॐ तत्पुरुषाय विद्महे महादेवाय धीमहि
                तन्नो रुद्रः प्रचोदयात्॥

                नाना सुगंध पुष्पांनी यथापादो भवानीच
                पुष्पांजलीर्मयादत्तो रुहाण परमेश्वर
                ॐ भूर्भुव: स्व: भगवते श्री सांबसदाशिवाय नमः।
                मंत्र पुष्पांजली समर्पयामि।।

                हरिः ॐ एक दंताय विद्महे वक्रतुण्डाय धीमहि। तन्नो दंतीप्रचोदयात् ।
                हरिः ॐ नारायण विद्महे वासुदेवाय धीमहि। तन्नो विष्णुः प्रचोदयात्।
                हरिः ॐ महालक्ष्म्यै च विद्महे विष्णु पत्त्यै च धीमहि । तन्नो लक्ष्मी प्रचोदयात्।
                हरिः ॐ नंद नन्दनाय विद्महे यशोदा नंदनाय धीमहि। तन्नो कृष्णः प्रचोदयात्।
                हरिः ॐ भास्कराय विद्महे दिवाकराय धीमहि । तन्नो सूर्यः प्रचोदयात् ।
                हरि ॐ अंजनी सुताय विद्महे वायुपुत्राय धीमहि। तन्नो हनुमत प्रचोदयात् ।
                हरि ॐ चतुर्मुखाय विद्महे हंसारुढ़ाय धीमहि। तन्नो ब्रह्मा प्रचोदयात्।
                हरिः ॐ परमहंसाय विद्महे महाहंसाय धीमहि । तन्नो हंसः प्रचोदयात्।
                हरिः ॐ श्री तुलस्यै विद्महे विष्णुप्रियायै च धीमहि । तन्नो वृन्दा प्रचोदयात् ।
                हरिः ॐ वृषभानुजायै च विद्महे कृष्णप्रियायै च धीमहि । तन्नो राधा प्रचोदयात् ।
                हरिः ॐ वृषभानुजायै च विद्महे कृष्णप्रियायै च धीमहि । तन्नो राधा प्रचोदयात् ।
                हरिः ॐ तत्पुरुषाय विद्महे महादेवाय धीमहि । तन्नो रुद्रः प्रचोदयात् ।

                ॐ सेवन्तिका बकुल चम्पक पाटलाब्जै,
                पुन्नाग जाति करवीर रसाल पुष्पैः बिल्व प्रवाल ।
                तुलसीदल मंजरीभिस्त्वां पूजयामि जगदीश्वर मे प्रसीद ॥

                मंदार माला कुलितालकायै कपालमालांकित शेखराय
                दिगम्बरायै च दिगम्बराय नमः शिवायै च नमः शिवाय ।

                ॐ नाना सुगन्धि पुष्पाणि यथा कालो भवानी च,
                पुष्पान्जलिर्मया दत्त ग्रहाण परमेश्वर ।`
    }
];

export interface AartiObj {
    title: string;
    lyrics: string;
}