export const MantraList: MantraObj[] = [
    {
        title: 'यज्ञोपवीत मंत्र',
        mantra:`वाजसनेयी मंत्र:ॐ यज्ञोपवीतं परमं पवित्रं प्रजापतेर्यत्सहजं पुरस्तात्। आयुष्यमग्रं प्रतिमुञ्च शुभ्रं यज्ञोपवीतं बलमस्तु तेजः।।"
        छन्दोग: ॐ यज्ञोपवीतमसि यज्ञस्य त्वोपवीतेनोपनह्यामि ।।`
    },
    {
        title:'नैवेद्य मंत्र',
        mantra:`ॐ नाभ्या आसीदन्तरिक्ष शीर्ष्णो द्यौः समवर्तत । 
        पद्भ्यां भूमिर्दिशः श्रोत्रातथा लोकाँ अकल्पयन्।।`,
        meaning:`इस मंत्र का अर्थ है कि परम पुरुष की नाभि से अंतरिक्ष, मस्तक से स्वर्ग, 
        पैरों से पृथ्वी और कानों से दिशाएँ प्रकट हुईं, जिससे सभी लोकों की कल्पना हुई।`,

    },
    {
        title: 'गायत्री मंत्र',  
        mantra: 'ॐ भूर्भुवः स्वः तत्सवितुर्वरेण्यं भर्गो देवस्य धीमहि धियो यो नः प्रचोदयात्।',
        meaning: 'हम उस परमात्मा का ध्यान करते हैं जो पृथ्वी, आकाश और स्वर्ग का पालन करने वाला है। हम उस दिव्य प्रकाश का ध्यान करते हैं जो सभी जीवों के लिए ज्ञान और बुद्धि को प्रज्वलित करता है।'
    },
    {
        title:'प्रदक्षिणा मंत्र',
        mantra:`यानि कानि च पापानि जन्मान्तरकृतानि च।
        तानि तानि प्रणश्यन्तु प्रदक्षिणपदे पदे।।
        
        उपयोग
        सामान्य प्रदक्षिणा: किसी भी देवता की मूर्ति या मंदिर की परिक्रमा करते समय.
        तुलसी प्रदक्षिणा: तुलसी के पौधे की परिक्रमा के लिए भी यह मंत्र उपयोगी है.
        पीपल प्रदक्षिणा: पीपल के पेड़ की परिक्रमा करते समय भी इसका प्रयोग किया जाता है।`,
        meaning:`इस जन्म और पिछले जन्मों में जो भी पाप किए गए हैं, वे सभी प्रदक्षिणा के प्रत्येक चरण (कदम) के साथ नष्ट हो जाएं।`
    },
    {
        title:'कुष्ठपाटन मंत्र',
        mantra:`ॐ ह्रीं फट् स्वाहा" "विरन्चिना सहोत्पन्न परमेष्ठिन्निसर्गज। नुद सर्वाणि पापानि दर्भ स्वस्तिकरो भव॥
        कुशाग्रह वस्ते रुद्रा कुश मध्य तू केशवह कुश मुले वसे ब्रह्म कुशानमें देही मेदिनी`
    },
    {
      title:'तर्पण मंत्र',
      mantra:`देवताओं के लिए तर्पण मंत्र
(पूर्व दिशा की ओर मुख करके, जनेऊ को सामान्य स्थिति में रखकर, सीधे हाथ की उंगलियों के अग्रभाग से जल अर्पित करें)
ॐ ब्रह्मणे नमः
ॐ प्रजापतये नमः
ॐ देवास्तृप्यन्ताम् (यह सामान्य मंत्र है) 
ऋषियों के लिए तर्पण मंत्र
(उत्तर दिशा की ओर मुख करके, जनेऊ को माला की तरह गले में पहनकर, हाथ की छोटी उंगली के मूल से जल अर्पित करें)
ॐ ऋषयो दिव्य मनुष्याः तृप्यन्ताम्
ॐ सप्तर्षयस्तृप्यन्ताम् 
पितरों (पूर्वजों) के लिए तर्पण मंत्र 
(दक्षिण दिशा की ओर मुख करके, जनेऊ को दाहिने कंधे पर और बाएं हाथ के नीचे (प्राचीनावीती) करके, हाथ के अंगूठे और तर्जनी के बीच के भाग से जल अर्पित करें, जल में काले तिल मिलाएं) 
सामान्य पितृ मंत्र (General Pitru Mantra):
ॐ पितृगणाय विद्महे जगत धारिणी धीमहि तन्नो पितृो प्रचोदयात्
ॐ देवताभ्यः पितृभ्यश्च महायोगिभ्य एव च। नमः स्वाहायै स्वधायै नित्यमेव नमो नमः
ॐ सर्व पितृ देवाय नमः
आवाहन मंत्र (Invocation Mantra):
ॐ आगच्छन्तु मे पितर इमं गृह्णन्तु जलाञ्जलिम्
अर्थात्: "हे पितरों, पधारिये और यह जलांजलि ग्रहण कीजिए।"
गोत्र और नाम के साथ तर्पण:
अपने गोत्र और मृत पूर्वज का नाम लेकर तीन बार जल अर्पित करें।
(गोत्र का नाम) गोत्रे अस्मत्पिता (पिता का नाम) वसुरूपस्तृप्यताम् इदं तिलोदकं तस्मै स्वधा नमः (यह मंत्र पिता के लिए है)
इसी प्रकार दादा (पितामह), परदादा (प्रपितामह), और फिर माता, दादी आदि के लिए मंत्रोच्चार किया जाता है। 
सरल दैनिक तर्पण मंत्र
यदि आप विस्तृत विधि नहीं कर सकते, तो सरल मंत्र से भी तर्पण कर सकते हैं: 
"ॐ पितृभ्यो स्वधा" 
ध्यान दें: तर्पण में शुद्धता, सही दि`
    },
    {
      title:'देवोत्थान एकादशी पर भगवान विष्णु को जगाने के लिए मंत्र',
      mantra:`ब्रह्मेन्द्ररुद्ररभिवन्द्यमानो भवानुषिर्वन्दित वन्दनीयः।
      प्राप्ता तवेयं किलकौमुदाख्या जागृष्व जागृष्व च लोकनाथ॥
      मेघा गता निर्मल पूर्णचन्द्रः शारद्यपुष्पाणि मनोहराणि।
      अहं ददानीति च पुण्यहेतो जागृष्व च लोकनाथ॥
      उत्तिष्ठोतिष्ठ गोविन्द त्यज निन्द्रां जगत्पते।
      त्वय चोत्थीय मानेन उत्थितं भुवनत्रयम्‌॥`
    },
    {
        title: 'दुर्वाक्षत मंत्र',
        mantra:`ॐ आब्रह्मन् ब्राह्मणो ब्रह्मवर्चसी जायतामाराष्ट्रे राजन्यः शूर इषव्यौऽतिव्याधि महारथो जायतां दोग्ध्री
         धेनुर्वोढानड्वानाशुः सप्तिः पुरन्ध्रिर्योषा जिष्णू रथेष्ठाः सभेयो युवास्य यजमानस्य वीरो जायाताम् । 
         निकामे निकामे नः पर्जन्यो वर्षतु फलवत्यो न औषधयः पच्यन्ताम् योगक्षेमो नः कल्पताम्।`,
         meaning:`हे ईश्वर! हमरा राष्ट्रमे ब्रह्मवर्चसी (ज्ञानसँ युक्त) ब्राह्मण उत्पन्न होथि।
          शूरवीर, इषुधारी, युद्धकुशल, महारथी क्षत्रिय जनमथि। दुधबाली गाइ,
           भारवहनमे सक्षम बैल, आ द्रुतगामी घोड़ा होथि। स्त्रिगण गुणी होथि।
            रथयात्रा करैवाला सब जयशील होथि। सभामे आसन लए योग्य पुत्र होथि। 
            आवश्यकता अनुसार वर्षा हो, फसल-औषधि फलदायी होथि। योग-क्षेम (प्राप्ति आ संरक्षण) सुनिश्चित हो।`
    },
    {
        title:'रक्षासूत्र मंत्र',
        mantra:`ॐ येन बद्धो बली राजा दानवेन्द्रो महाबल:।
                तेन त्वामनुबध्नामि रक्षे मा चल मा चल।।`,
        meaning:`दानवक महाबली राजा बलि जेना बान्हल गेल छलाह, 
        तहिना हम अहाँके बान्धि रहल छी। हे रक्षे! अहाँ स्थिर रहू, चलू नै, चलू नै।`
    },
    {
        title:'सावित्री मन्त्र',
        mantra:`ॐ भूः ॐ भुवः ॐ स्वः ॐ महः ॐ जनः ॐ तपः ॐ सत्यम् ॐ`
    },
    {
        title: 'दुर्गा मंत्र',
        mantra: 'ॐ ऐं ह्लीं क्लीं चामुण्डायै विच्चे।',
        meaning: 'मैं देवी चामुण्डा को नमन करता हूँ, जो सभी प्रकार के भय और बाधाओं को दूर करने वाली हैं।'
    },
    {
        title: 'महामृत्युंजय मंत्र',  
        mantra: 'ॐ त्र्यम्बकं यजामहे सुगन्धिं पुष्टिवर्धनम्। उर्वारुकमिव बन्धनान्मृत्योर्मुक्षीय माऽमृतात्॥',
        meaning: 'हम त्रिनेत्र वाले भगवान शिव की पूजा करते हैं, जो सुगंधित और जीवनदायिनी हैं। जैसे खीरा बेल से बंधन से मुक्त होता है, वैसे ही हमें मृत्यु के बंधन से मुक्त कर अमरता प्रदान करें।'
    },
    {
        title: 'सहस्रशीर्षा मंत्र',
        mantra: `सहस्रशीर्षा पुरुषः सहस्राक्षः सहस्रपात् ।
                स भूमिं विश्वतो वृत्वात्यतिष्ठद्दशाङुलम् ॥१॥

                पुरुष एवेदं सर्वं यद्भूतं यच्च भव्यम् ।
                उतामृतत्वस्येशानो यदन्नेनातिरोहति ॥२॥

                एतावानस्य महिमातो ज्यायाँश्च पूरुषः ।
                पादोऽस्य विश्वा भूतानि त्रिपादस्यामृतं दिवि ॥३॥

                त्रिपादूर्ध्व उदैत्पूरुषः पादोऽस्येहाभवत्पुनः ।
                ततो विष्वङ् व्यक्रामत्साशनानशने अभि ॥४॥

                तस्माद्विराळजायत विराजो अधि पूरुषः ।
                स जातो अत्यरिच्यत पश्चाद्भूमिमथो पुरः ॥५॥

                यत्पुरुषेण हविषा देवा यज्ञमतन्वत ।
                वसन्तो अस्यासीदाज्यं ग्रीष्म इध्मः शरद्धविः ॥६॥

                तं यज्ञं बर्हिषि प्रौक्षन्पुरुषं जातमग्रतः ।
                तेन देवा अयजन्त साध्या ऋषयश्च ये ॥७॥

                तस्माद्यज्ञात्सर्वहुतः सम्भृतं पृषदाज्यम् ।
                पशून्ताँश्चक्रे वायव्यानारण्यान् ग्राम्याश्च ये ॥८॥

                तस्माद्यज्ञात्सर्वहुत ऋचः सामानि जज्ञिरे ।
                छन्दांसि जज्ञिरे तस्माद्यजुस्तस्मादजायत ॥९॥

                तस्मादश्वा अजायन्त ये के चोभयादतः ।
                गावोः ह जज्ञिरे तस्मात् तस्माज्जाता अजावयः ॥१०॥

                यत्पुरुषं व्यदधुः कतिधा व्यकल्पयन् ।
                मुखं किमस्य कौ बाहू का ऊरू पादा उच्येते ॥११॥

                ब्राह्मणोऽस्य मुखमासीद् बाहू राजन्यः कृतः ।
                ऊरू तदस्य यद्वैश्यः पद्भ्यां शूद्रो अजायत ॥१२॥

                चन्द्रमा मनसो जातश्चक्षोः सूर्यो अजायत ।
                मुखादिन्द्रश्चाग्निश्च प्राणाद्वायुरजायत ॥१३॥

                नाभ्या आसीदन्तरिक्षं शीर्ष्णो द्यौः समवर्तत ।
                पद्भ्यां भूमिर्दिशः श्रोत्रात्तथा लोकाँ अकल्पयन् ॥१४॥

                सप्तास्यासन् परिधयस्त्रिः सप्त समिधः कृताः ।
                देवा यद्यज्ञं तन्वाना अबध्नन्पुरुषं पशुम् ॥१५॥

                यज्ञेन यज्ञमयजन्त देवास्तानि धर्माणि प्रथमान्यासन् ।
                ते ह नाकं महिमानः सचन्त यत्र पूर्वे साध्याः सन्ति देवाः ॥१६॥`
    },
    {
        title: 'स्वस्तिवाचन मंत्र',
        mantra: `ॐ आनोभद्रा: क्रतवो यन्तु विस्वतो
                दब्धासो अपरीतास उद्भिद:।
                देवानो यथा सदमिद वृधे
                असन्नप्रायुवो रक्षितारो दिवे दिवे।।

                देवानां भद्रा सुमतिर्रिजुयताम देवाना
                ग्वंग रातिरभि नो निवार्ताताम।
                देवानां ग्वंग सख्यमुपसेदिमा वयम
                देवान आयु: प्रतिरन्तु जीवसे।।

                तान पूर्वया निविदा हूमहे वयम
                भगं मित्र मदितिम दक्षमस्रिधम।
                अर्यमणं वरुण ग्वंग सोममस्विना
                सरस्वती न: सुभगा मयस्करत ।।

                तन्नोवातो मयोभूवातु भेषजं
                तन्नमाता पृथिवी तत्पिता द्यौ: ।
                तद्ग्रावान: सोमसुतो मयोभूवस्त
                दस्विना श्रुनुतं धिष्ण्या युवं ।।

                तमीशानं जगतस्तस्थुखसपतिं
                धियंजिन्वमवसे हूमहे वयम ।
                पूषा नो यथा वेद सामसद वृधे
                रक्षिता पायुरदब्ध: स्वस्तये ।।

                स्वस्ति न इन्द्रो वृद्ध श्रवा:
                स्वस्ति न पूषा विस्ववेदा: ।
                स्वस्ति नस्तार्क्ष्यो अरिष्टनेमि:
                स्वस्ति नो वृहस्पति दधातु।।

                पृषदश्वा मरुत: प्रिश्निमातर:
                शुभं यावानो विदथेषु जग्मय:।
                अग्निजिह्वा मनव: सूरचक्षसो
                विश्वे नो देवा अवसागमन्निह।।

                भद्रं कर्णेभि: शृणुयाम देवा
                भद्रं पश्येमाक्षभिर्यजत्राः ।
                स्थिरैरङ्गैस्तुष्टुवा ग्वंग सस्तनू
                भिर्व्यशेमहि देवहितं यदायु:।।

                शतमिन्नु शरदो अन्ति देवा
                यत्रा नश्चक्रा जरसं तनूनाम् ।
                पुत्रासो यत्र पितरो भवन्ति
                मानो मध्या रीरिषतायुर्गन्तो:।।

                अदितिर्द्यौरदितिरन्तरिक्ष्म
                दितिर्माता स पिता स पुत्र:।
                विश्वेदेवा अदिति: पञ्चजना
                अदितिर्जातमदितिर्जनित्वम् ।।

                द्यौ: शान्ति रन्तरिक्ष् ग्वंग शान्ति: पृथिवी
                शान्ति राप: शान्ति रोषधय: शान्ति:।
                वनस्पतय: शान्तिर्विश्वे देवा: शान्तिर्ब्रह्म
                शान्ति: सर्व ग्वंग शान्ति: शान्तिरेव
                शान्ति: सामा शान्तिरेधि।।

                यतो यत: समीहसे ततो नो अभयं कुरु ।
                शं न: कुरु प्रजाभ्यो भयं न: पशुभ्य: ।।
             
                सुशान्तिर्भवतु
                श्री मन्महागणाधिपतये नमः।
                लक्ष्मीनारायणाभ्यां नम:।
                उमामहेश्वराभ्यां नम:।
                वाणीहिरण्यगर्भाभ्यां नं:।
                शचिपुरन्दराभ्यां नम:।
                इष्टदेवताभ्यो नम:।
                कुलदेवताभ्यो नम:।
                ग्रामदेवताभ्यो नम:।
                वास्तुदेवताभ्यो नम:।
                स्थानदेवताभ्यो नम:।
                सर्वेभ्यो देवेभ्यो नम:।
                सर्वेभ्यो ब्राह्मणेभ्यो नम:।

                ॐ सिद्धिबुद्धिसहिताय 
                श्री मन्महागणाधिपतये नम:।
                सुमुखश्चैकदन्तश्च
                कपिलो गजकर्णकः।
                लम्बोदरश्च विकटो
                विघ्ननाशो विनायक:।।

                धूम्रकेतुर्गणाध्यक्षो
                भालचन्द्रो गजानन:।
                द्वद्शैतानि नामानि
                यः पठे च्छ्रिणुयादपी।।

                विद्यारंभे विवाहे च
                प्रवेशे निर्गमे तथा।
                संग्रामे संकटे चैव
                विघ्नस्तस्य न जायते।।

                शुक्लाम्बरधरं देवं
                शशिवर्णं चतुर्भुजम्।
                प्रसन्नवदनं ध्यायेत्
                सर्व्विघ्नोपशान्तये।।

                अभिप्सितार्थ सिद्ध्यर्थं
                पूजितो य: सुरासुरै:।
                सर्वविघ्नहरस्तस्मै
                णाधिपतये नम:।।

                सर्वमङ्गलमाङ्गल्ये !
                शिवे ! सर्वार्थसाधिके।
                शरण्ये त्र्यम्बिके !
                गौरी नारायणि नमोस्तुते।।

                सर्वदा सर्वकार्येषु
                नास्ति तेषाममङ्गलम्।
                येषां हृदयस्थो भगवान्
                मङ्गलायतनो हरि:।।

                तदेव लग्नं सुदिनं तदेव,
                ताराबलं चन्द्रबलं तदेव ।
                विद्याबलं दैवबलं तदेव,
                लक्ष्मीपते तेन्घ्रियुगं स्मरामि।।

                लाभस्तेषां जयस्तेषां
                कुतस्तेषां पराजय:।
                येषामिन्दीवरश्यामो
                हृदयस्थो जनार्दन:।।

                यत्र योगेश्वर: कृष्णो
                यत्र पार्थो धनुर्धर:।
                तत्र श्रीर्विजयो भूति
                र्ध्रुवा नीतिर्मतिर्मम।।

                अनन्यास्चिन्तयन्तो मां
                ये जना: पर्युपासते।
                तेषां नित्याभियुक्तानां
                योगक्षेमं वहाम्यहम्।।

                स्मृतेःसकल कल्याणं
                भाजनं यत्र जायते।
                पुरुषं तमजं नित्यं
                व्रजामि शरणं हरम्।।

                सर्वेष्वारंभ कार्येषु
                त्रय:स्त्री भुवनेश्वरा:।
                देवा दिशन्तु नः सिद्धिं
                ब्रह्मेशानजनार्दना:।।

                विश्वेशम् माधवं दुन्धिं
                दण्डपाणिं च भैरवम्।
                वन्दे कशी गुहां गंगा
                भवानीं मणिकर्णिकाम्।।

                वक्रतुण्ड् महाकाय
                सूर्य कोटि समप्रभ।
                निर्विघ्नं कुरु में देव
                सर्वकार्येषु सर्वदा।।

               ॐ श्री गणेशाम्बिका भ्यां नम: ||`
    }
];

export interface MantraObj {
    title: string;
    mantra: string;
    meaning?: string;
}